import { MenuType } from "@/app/type/menu";

/**
 * メニュー一覧
 */
export const MENUS: MenuType = {
  /**
   * カット一覧
   */
  CUT_LIST: [
    {
      name: "カット（シャンプー・ブロー込）",
      price: 2300,
    },
    {
      name: "高校生カット【カット＋シャンプー＆顔そり込み】",
      price: 1800,
    },
    {
      name: "一般カット(ｼｬﾝﾌﾟｰ､眉ｶｯﾄ､お顔そり込)",
      price: 2800,
    },
    {
      name: "フェードカット",
      price: 2800,
    },
    {
      name: "大学生カット【カット＋シャンプー＆顔そり込み】",
      price: 2800,
    },
    {
      name: "中学生カット",
      price: 1400,
    },
    {
      name: "小学生カット",
      price: 1300,
    },
    {
      name: "学生丸刈り",
      price: 1200,
    },
  ],
  /**
   * カラー一覧
   */
  COLOR_LIST: [
    {
      name: "白髪染め「黒色」【カット＋シャンプー＆顔そり込み】",
      price: 4200,
    },
    {
      name: "ヘアカラー【カット＋シャンプー＆顔そり込み】",
      price: 4500,
    },
  ],
  /**
   * パーマ一覧
   */
  PERM_LIST: [
    {
      name: "パーマ【カット＋シャンプー＆顔そり込み】",
      price: 6000,
    },
    {
      name: "デザインパーマ【カット＋シャンプー＆顔そり込み】",
      price: 5500,
    },
    {
      name: "アイロンパーマ【カット＋シャンプー＆顔そり込み】",
      price: 5300,
    },
    {
      name: "アイパーマ【カット＋シャンプー＆顔そり込み】",
      price: 4900,
    },
    {
      name: "ツイストパーマ【カット＋シャンプー＆顔そり込み】",
      price: 5500,
    },
  ],
};
